#+TITLE:radio tracking collars 
#+AUTHOR: Ivan Hanigan
#+email: ivan.hanigan@anu.edu.au
#+LaTeX_CLASS: article
#+LaTeX_CLASS_OPTIONS: [a4paper]
#+LATEX: \tableofcontents
-----
*** COMMENT R_download-google-ssheet 
#+name:R_download-google-ssheet
#+begin_src R :session *R* :tangle radio-tracking-farm-dogs.r :exports none :eval yes
  # this script runs the ExtractAWAPGRIDS functions for sample locations
  # depends on swishdbtools and awaptools package from http:/swish-climate-impact-assessment.github.com
  
  ################################################################
  # name:R_download-google-ssheet
  # eg
  url <-
   "https://docs.google.com/spreadsheet/pub?key=0AjrmPjvc7LwOdFowTzJ2T2xsa1pkeVdRd3VlQjZtdHc&output=csv"
  # eg
  outputFileName <- "locations.dta"
  # eg
  workingdir <- "~/projects/radio-tracking-collars"
  require(RCurl)
  require(foreign)
  d <- read.csv(textConnection(getURLContent(url)))
  #str(d)
  #summary(d)
  names(d)  <- tolower(names(d))
  # add a primary key 
  d$fid <- 1:nrow(d)
  write.dta(d, file.path(workingdir,outputFileName))
  tempTableName <- outputFileName
  tempTableName
  
#+end_src

#+RESULTS: download-google-ssheet
: locations.dta
